
<script>
    import JumpIcon from "$lib/assets/icons/jump.svelte";
    import SvgIcon from "$lib/components/ui/SvgIcon";
</script>

<svelte:head>
    <title>プライバシーポリシー | moizlu</title>
</svelte:head>

<main class="w-full h-full py-20 flex-col-center select-text">
    <h1 class="m-5">プライバシーポリシー</h1>

    <div class="p-5 w-full max-w-200 text-left">
        <p class="pb-10">もいずる(以下、「当方」といいます。)は、本ウェブサイト(以下、「当サイト」といいます。)におけるユーザーの個人情報の取扱いについて、以下の通りプライバシーポリシー(以下、「本方針」といいます。)を定めます。</p>

        <h2>1.個人情報の収集について</h2>
        <p>当サイトでは、お問い合わせフォームを通じて以下の情報を収集・利用します。</p>
        <ul>
            <li>フォームに入力されたお名前、メールアドレス、件名、お問い合わせ内容</li>
            <li>IPアドレス、ブラウザ情報、端末情報(スパム判定・セキュリティ目的)</li>
        </ul>

        <p>また、サイトの利用状況を把握するため、Cloudflare Web Analyticsを使用して統計情報(個人を特定しない情報)を収集しています。</p>
        <p class="text-sm">※当サイトでは、クッキー(Cookie)またはそれに類する技術を使用する場合があります。これらはブラウザの設定により無効化することが可能です。</p>

        <h2>2.個人情報の利用目的</h2>
        <p>収集した個人情報は、以下の目的でのみ利用します。</p>
        <ul>
            <li>サイトの利用状況の分析によるサービス改善のため(統計情報のみ)</li>
            <li>お問い合わせへの対応及び本人確認のため</li>
            <li>スパム行為や不正アクセスの防止のため</li>
        </ul>

        <h2>3.個人情報の第三者への提供</h2>
        <p>当サイトは、原則として法令に基づく場合を除き取得した個人情報をユーザーの同意なく第三者に開示することはありません。<br>
            ただし、利用目的の達成に必要な範囲内で、第4条に定める外部サービスへ処理を委託しています。</p>

        <h2>4.外部サービスへの委託</h2>
        <p>当サイトは、利用目的の達成に必要な範囲内で以下の外部サービスを利用しています。これらのサービスにおける情報の取り扱いは各社のプライバシーポリシーに基づきます。</p>
        <p>これらのサービスを提供する事業者は日本国外(米国等)に所在する場合があり、ユーザーは情報の送信をもって、これら外部サービスへの情報提供に同意したものとみなされます。</p>
        <ul>
            <li>Cloudflare</li>
            <li class="pl-5">サイトのホスティングと保護、統計情報の分析</li>
            <li>Resend</li>
            <li class="pl-5">メールの送信</li>
            <li>Upstash</li>
            <li class="pl-5">レート制限の管理</li>
        </ul>

        <h2>5.スパム対策及びセキュリティについて</h2>
        <p>当サイトでは、安全な運営のために以下の対策を実施しています。</p>
        <ul>
            <li>CAPTCHA(Cloudflare Turnstile)</li>
            <li class="pl-5">Botによる不正な操作を検知・遮断するために利用しています。認証のため、Cloudflareのプライバシーポリシーの範囲内において各種情報が収集される場合があります。</li>
            <li>レート制限(Upstash)</li>
            <li class="pl-5">当サイトを悪用したスパム攻撃を防止するため、ユーザーのIPアドレスと入力されたメールアドレスを非可逆的な形式に変換した上で、一時的な送信回数の制限に利用しています。当サイトが未加工のIPアドレス・メールアドレスを含むその他の情報をこの目的で保存することはありません。</li>
        </ul>

        <h2>6.安全管理措置</h2>
        <p>当サイトでは、以下の通り技術的な安全管理措置を講じています。</p>
        <ul>
            <li>SSL/TLS暗号化</li>
            <li class="pl-5">全ての通信は暗号化されています。</li>
            <li>識別情報のハッシュ化</li>
            <li class="pl-5">レート制限に使用する識別情報(メールアドレス、IPアドレス)は、ハッシュ化によって復元が極めて困難な形式に変換した上で対応に必要な期間のみ保存されます。</li>
            <li class="pl-5">当方がユーザーの未加工のIPアドレスを閲覧することはありません。</li>
        </ul>

        <h2>7.保有個人データの開示・訂正・利用停止などの請求手続き</h2>
        <p>ユーザーは当サイトが保有する個人データについて、自身の個人データの開示、訂正、追加または削除、利用の停止または消去を請求する事ができます。<br>請求があった場合はご本人であることを確認の上、速やかに対応いたします。<br>下記の問い合わせフォームまたはメールアドレスよりご連絡ください。</p>

        <h2>8.免責事項</h2>
        <p>当サイトからリンクなどによって他のサイトに移動された場合、移動先サイトで提供される情報・サービス等について一切の責任を負いません。</p>

        <h2>9.当方針の変更と反映</h2>
        <p>本方針は法令に反しない範囲で予告なく変更される可能性があります。この場合、当該変更の効力は変更がこのWebサイト上に表示された時点から即時に発生します。</p>

        <h2>10.お問い合わせ先</h2>
        <a href="/#contact" target="_blank" class="flex justify-start items-center inline-link">
            <p>お問い合わせフォーム</p>
            <SvgIcon Svg={JumpIcon} size={20} />
        </a>

        <p>運営者: もいずる</p>

        <p class="text-right">策定日: 2026年02月19日</p>
    </div>
</main>

<style>
    @reference "../../layout.css";

    h1 {
        @apply text-2xl xs:text-4xl sm:text-6xl;
    }

    h2 {
        @apply m-3 text-2xl sm:text-3xl rounded-2xl border-label border p-2;
    }

    /* h3 {
        @apply m-1 text-[15px] sm:text-[20px];
    } */

    p {
        @apply m-1 pl-5 my-3;
    }

    ul {
        @apply pl-2 list-disc list-inside;
    }

    li {
        @apply ml-5;
    }

</style>
